Catalogs/EDUsageAgreements.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>EDUsageAgreements</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ServerAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageFormatVersion</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDPackageFormatVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyContract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalInformationProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeEDPackageFormat</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CryptographyIsUsed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentsDir</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentsDirFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutgoingDocumentsDir</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutgoingDocumentsDirFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Banks</v8:Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ErrorDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VerifySignatureCertificates</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankApplication</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BankApplications</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDFProfileSettings</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementSetupExtendedMode</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentsResource</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutgoingDocumentsResource</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyCertificateForEncryption</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyCertificateForDetails</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DigitalSignaturesAndEncryptionKeyCertificates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementState</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDAgreementStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDExchangeMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConnectionStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMemberStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDAgreementsStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InvitationText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteRequiredSignaturesNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteSubscribersLogin</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletePartner</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletePassiveFTPConnection</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteFTPPort</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteSubscriberCertificate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DeleteDSCertificates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteCompanyCertificateForDetails</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DeleteDSCertificates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteTypicalAgreement</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteIsTypical</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EncryptEDPackageData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailForInvitation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsIntercompany</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>OutgoingDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>OutgoingDocument</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UseDS</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExpectDeliveryTicket</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ToForm</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FormatVersion</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDFProfileSettings</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CounterpartyID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CompanyID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDExchangeMethod</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDExchangeMethods</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CounterpartySignaturesCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Certificate</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CounterpartyCertificatePresentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CompanySignatureCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NumberContainer</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Certificate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DigitalSignaturesAndEncryptionKeyCertificates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteCertificate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DeleteDSCertificates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>IncomingDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IncomingDocument</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UseDS</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExpectDeliveryTicket</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ToForm</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ExchangeFilesFormats</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Use</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FileFormat</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDExchangeFileFormats</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/EDUsageAgreements/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

Procedure FormGetProcessing(FormKind, Parameters, SelectedForm, AdditionalInformation, StandardProcessing)
	
	If FormKind = "ListForm"
		Or FormKind = "ChoiceForm" Then
		Return;
	EndIf;
	
	If Parameters.Property("Key") AND ValueIsFilled(Parameters.Key) Then
		
		AgreementAttributes = ElectronicDocumentsServiceCallServer.EDFSettingAttributes(Parameters.Key);
		IsIntercompany = AgreementAttributes.IsIntercompany;
		EDExchangeMethod = AgreementAttributes.EDExchangeMethod;
		
	ElsIf Parameters.Property("FillingValues") 
		AND TypeOf(Parameters.FillingValues) = Type("Structure")
		AND Parameters.FillingValues.Property("IsIntercompany")
		AND Parameters.FillingValues.Property("EDExchangeMethod") Then
		
		IsIntercompany = Parameters.FillingValues.IsIntercompany;
		EDExchangeMethod = Parameters.FillingValues.EDExchangeMethod;
		
	ElsIf Parameters.Property("CopyingValue") 
		AND ValueIsFilled(Parameters.CopyingValue)
		AND TypeOf(Parameters.CopyingValue) = Type("CatalogRef.EDUsageAgreements") Then 
		
		AgreementAttributes = ElectronicDocumentsServiceCallServer.EDFSettingAttributes(Parameters.CopyingValue);
		IsIntercompany = AgreementAttributes.IsIntercompany;
		EDExchangeMethod = AgreementAttributes.EDExchangeMethod;
		
	Else
		IsIntercompany = Undefined;
		EDExchangeMethod = Undefined;
	EndIf;
	
	StandardProcessing = False;
	
	SelectedForm = "ItemForm";
	If IsIntercompany = True Then
		SelectedForm = "IntercompanyItemForm";
	ElsIf EDExchangeMethod = PredefinedValue("Enum.EDExchangeMethods.ThroughBankWebSource") Then
		SelectedForm = "ItemFormBank";
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// SERVICE PROCEDURES AND FUNCTIONS

////////////////////////////////////////////////////////////////////////////////
// Info base update

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Handler of the update BED 1.0.4.0
// divides TORG12 into TORG12Seller and TORG12Customer, AcceptanceCertificate into ActPerformer and ActCustomer
//
Procedure RefreshDocumentKinds() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	EDUsageAgreements.Ref
	|FROM
	|	Catalog.EDUsageAgreements AS EDUsageAgreements
	|WHERE
	|	Not EDUsageAgreements.DeletionMark
	|	AND EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughDirectory)";
	
	Result = Query.Execute().Select();
	
	While Result.Next() Do
		
		AgreementToFind = Result.Ref.GetObject();
		WriteObject = False;
		
		TORG12Seller = AgreementToFind.OutgoingDocuments.Find(Enums.EDKinds.TORG12Seller, "OutgoingDocument");
		
		If TORG12Seller = Undefined Then
			FoundString= AgreementToFind.OutgoingDocuments.Find(Enums.EDKinds.TORG12, "OutgoingDocument");
			If FoundString <> Undefined Then
				NewRow = AgreementToFind.OutgoingDocuments.Append();
				NewRow.OutgoingDocument         = Enums.EDKinds.TORG12Seller;
				NewRow.UseDS           = FoundString.UseDS;
				NewRow.ExpectDeliveryTicket = FoundString.ExpectDeliveryTicket;
				NewRow.ToForm               = FoundString.ToForm;
				WriteObject = True;
			EndIf;
		EndIf;
		
		TORG12Customer = AgreementToFind.OutgoingDocuments.Find(
								Enums.EDKinds.TORG12Customer,
								"OutgoingDocument");
		
		If TORG12Customer = Undefined Then
			FoundString = AgreementToFind.IncomingDocuments.Find(Enums.EDKinds.TORG12, "IncomingDocument");
			If FoundString <> Undefined Then
				NewRow = AgreementToFind.OutgoingDocuments.Append();
				NewRow.OutgoingDocument         = Enums.EDKinds.TORG12Customer;
				NewRow.UseDS           = FoundString.UseDS;
				NewRow.ExpectDeliveryTicket = FoundString.ExpectDeliveryTicket;
				NewRow.ToForm               = FoundString.ToForm;
				WriteObject = True;
			EndIf;
		EndIf;
		
		ActPerformer = AgreementToFind.OutgoingDocuments.Find(Enums.EDKinds.ActPerformer, "OutgoingDocument");
		
		If ActPerformer = Undefined Then
			FoundString = AgreementToFind.OutgoingDocuments.Find(
									Enums.EDKinds.AcceptanceCertificate,
									"OutgoingDocument");
			If FoundString <> Undefined Then
				NewRow = AgreementToFind.OutgoingDocuments.Append();
				NewRow.OutgoingDocument         = Enums.EDKinds.ActPerformer;
				NewRow.UseDS           = FoundString.UseDS;
				NewRow.ExpectDeliveryTicket = FoundString.ExpectDeliveryTicket;
				NewRow.ToForm               = FoundString.ToForm;
				WriteObject = True;
			EndIf;
		EndIf;
		
		ActCustomer = AgreementToFind.OutgoingDocuments.Find(Enums.EDKinds.ActCustomer, "OutgoingDocument");
		
		If ActCustomer = Undefined Then
			FoundString = AgreementToFind.IncomingDocuments.Find(Enums.EDKinds.AcceptanceCertificate,
																		"IncomingDocument");
			If FoundString <> Undefined Then
				NewRow = AgreementToFind.OutgoingDocuments.Append();
				NewRow.OutgoingDocument         = Enums.EDKinds.ActCustomer;
				NewRow.UseDS           = FoundString.UseDS;
				NewRow.ExpectDeliveryTicket = FoundString.ExpectDeliveryTicket;
				NewRow.ToForm               = FoundString.ToForm;
				WriteObject = True;
			EndIf;
		EndIf;
		
		If WriteObject Then
			InfobaseUpdate.WriteObject(AgreementToFind)
		EndIf;
		
	EndDo;
	
EndProcedure

// Handler of the update BED 1.1.6.3
// Executes filling the format version in the tabular section of OutgoingDocuments.
//
Procedure FillFormatsVersions() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	EDUsageAgreements.Ref
	|FROM
	|	Catalog.EDUsageAgreements AS EDUsageAgreements
	|WHERE
	|	Not EDUsageAgreements.DeletionMark
	|	AND EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughDirectory)";
	
	Result = Query.Execute().Select();
	
	While Result.Next() Do
		
		AgreementToFind = Result.Ref.GetObject();
		WriteObject = False;
		
		For Each DocumentKind IN AgreementToFind.OutgoingDocuments Do
			If DocumentKind.ToForm AND Not ValueIsFilled(DocumentKind.FormatVersion)
				AND DocumentKind.OutgoingDocument = Enums.EDKinds.ProductsDirectory Then
				
				DocumentKind.FormatVersion = "CML 4.02";
				WriteObject = True;
			EndIf;
		EndDo;
		
		If WriteObject Then
			InfobaseUpdate.WriteObject(AgreementToFind);
		EndIf;
		
	EndDo;
	
EndProcedure

// Handler of the update BED 1.1.7.1 
// Transfers the DS certificate from the attribute of "Certificate of authorization" to the tabular section "CompanySignatureCertificates".
//
Procedure TransferCertificateAuthorizationInTP() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	EDUsageAgreements.Ref,
	|	EDUsageAgreements.DeleteSubscriberCertificate
	|FROM
	|	Catalog.EDUsageAgreements AS EDUsageAgreements
	|WHERE
	|	Not EDUsageAgreements.DeletionMark
	|	AND EDUsageAgreements.EDExchangeMethod = &EDExchangeMethod";
	
	Query.SetParameter("EDExchangeMethod", Enums.EDExchangeMethods.ThroughEDFOperatorTaxcom);
	Selection = Query.Execute().Select();
	
	While Selection.Next() Do
		
		DSCertificate = Selection.DeleteSubscriberCertificate;
		If ValueIsFilled(DSCertificate) Then
			EDAgreement = Selection.Ref.GetObject();
			NewRow = EDAgreement.CompanySignatureCertificates.Append();
			NewRow.Certificate = DSCertificate;
			EDAgreement.DeleteSubscriberCertificate = Undefined;
			InfobaseUpdate.WriteObject(EDAgreement);
		EndIf;
		
	EndDo;
	
EndProcedure

// Handler of the update BED 1.1.7.4 
// Executes filling the format version in the tabular section of OutgoingDocuments.
//
Procedure FillFormatsVersionsOfOutgoingEDAndPackage() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	EDUsageAgreements.Ref
	|FROM
	|	Catalog.EDUsageAgreements AS EDUsageAgreements
	|WHERE
	|	Not EDUsageAgreements.DeletionMark
	|	AND (EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughDirectory)
	|	OR EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughFTP)
	|	OR EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughEMail))";
	
	Result = Query.Execute().Select();
	
	While Result.Next() Do
		
		AgreementToFind = Result.Ref.GetObject();
		WriteObject = False;
		
		For Each DocumentKind IN AgreementToFind.OutgoingDocuments Do
			If Not ValueIsFilled(DocumentKind.FormatVersion) Then
				
				FormatVersion = "CML 4.02";
				If DocumentKind.OutgoingDocument = Enums.EDKinds.RandomED Then
					
					FormatVersion = "";
				ElsIf DocumentKind.OutgoingDocument = Enums.EDKinds.ActCustomer
					OR DocumentKind.OutgoingDocument = Enums.EDKinds.ActPerformer
					OR DocumentKind.OutgoingDocument = Enums.EDKinds.TORG12Customer
					OR DocumentKind.OutgoingDocument = Enums.EDKinds.TORG12Seller Then
					
					FormatVersion = "Federal Tax Service 5.01";
				EndIf;
				
				DocumentKind.FormatVersion = FormatVersion;
				WriteObject = True;
			EndIf;
		EndDo;
		
		If Not ValueIsFilled(AgreementToFind.PackageFormatVersion) Then
			AgreementToFind.PackageFormatVersion = Enums.EDPackageFormatVersions.Version10;
		EndIf;
			
		If WriteObject Then
			InfobaseUpdate.WriteObject(AgreementToFind);
		EndIf;
		
	EndDo;
	
EndProcedure

// Handler of the update BED 1.1.13.6
// Executes filling the format version in the tabular section of OutgoingDocuments.
//
Procedure UpdateOutgoingEDIPackFormatsVersions() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	EDUsageAgreements.Ref
	|FROM
	|	Catalog.EDUsageAgreements AS EDUsageAgreements
	|WHERE
	|	(EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughDirectory)
	|			OR EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughFTP)
	|			OR EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughEMail))";
	
	Result = Query.Execute().Select();
	While Result.Next() Do
		
		AgreementToFind = Result.Ref.GetObject();
		WriteObject = False;
		
		For Each DocumentKind IN AgreementToFind.OutgoingDocuments Do
			If ValueIsFilled(DocumentKind.FormatVersion)
				AND DocumentKind.FormatVersion = "CML 2.06" Then
				
				DocumentKind.FormatVersion = "CML 2.07";
				WriteObject = True;
			EndIf;
		EndDo;
		
		If WriteObject Then
			InfobaseUpdate.WriteObject(AgreementToFind);
		EndIf;
		
	EndDo;

EndProcedure

// Handler of the update BED 1.1.14.2
// Executes filling the attribute "CryptographyIsUsed".
//
Procedure FillCryptographyUsage() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	EDUsageAgreements.Ref
	|FROM
	|	Catalog.EDUsageAgreements AS EDUsageAgreements
	|WHERE
	|	Not EDUsageAgreements.CryptographyIsUsed
	|	AND EDUsageAgreements.User = """"";
	
	Result = Query.Execute().Select();
	While Result.Next() Do
		EDAgreement = Result.Ref.GetObject();
		EDAgreement.CryptographyIsUsed = True;
		InfobaseUpdate.WriteObject(EDAgreement);
	EndDo;
	
EndProcedure

// Handler of the
// update BED 1.2.2.2 Executes filling the format version in the tabular section of OutgoingDocuments.
//
Procedure UpdateOutgoingED207FormatVersion_208() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	EDUsageAgreements.Ref
	|FROM
	|	Catalog.EDUsageAgreements AS EDUsageAgreements
	|WHERE
	|	(EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughDirectory)
	|			OR EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughFTP)
	|			OR EDUsageAgreements.EDExchangeMethod = VALUE(Enum.EDExchangeMethods.ThroughEMail))";
	
	Result = Query.Execute().Select();
	While Result.Next() Do
		
		AgreementToFind = Result.Ref.GetObject();
		WriteObject = False;
		
		For Each DocumentKind IN AgreementToFind.OutgoingDocuments Do
			If ValueIsFilled(DocumentKind.FormatVersion)
				AND (DocumentKind.FormatVersion = "CML 2.06"
					Or DocumentKind.FormatVersion = "CML 2.07") Then
				
				DocumentKind.FormatVersion = "CML 2.08";
				WriteObject = True;
			EndIf;
		EndDo;
		
		If WriteObject Then
			InfobaseUpdate.WriteObject(AgreementToFind);
		EndIf;
		
	EndDo;

EndProcedure

#EndIf
